# 1. Берем за основу официальный, рабочий образ n8n последней версии
FROM docker.n8n.io/n8nio/n8n:latest

# 2. Переключаемся на пользователя root, чтобы создать папку для данных n8n
USER root

# 3. Создаем папку, в которую мы скопируем ваши воркфлоу
# и сразу назначаем ей правильного владельца (пользователя node)
RUN mkdir -p /home/node/.n8n/ && chown -R node:node /home/node/.n8n

# 4. Переключаемся обратно на стандартного, безопасного пользователя n8n
USER node

# 5. Копируем все из вашей будущей папки .n8n в репозитории
# в нужную директорию внутри контейнера
COPY --chown=node:node .n8n/ /home/node/.n8n/
